# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [1]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [2]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
    , index = ["a","b","c"]
)

# Standaard print
print(df)

# Vergelijk met
df   # jupyther functie
display(df)

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

In [3]:
# Data opslaan
df.to_csv('./output/persons0.csv')  # zorg dat de folder bestaat waar je de data op wil slaan.

In [4]:
# Data opslaan
df.to_csv('./output/persons.csv',header = True, index = False)  # zet de header en de index aan of uit.

In [5]:
# Data inlezen
df_saved =pd.read_csv('./output/persons.csv')

display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [6]:
# De kolomnaam
df.columns[1]

'Age'

In [7]:
# Een kolom lezen
display(df['Age'])

type(df['Age'])

a    22
b    35
c    58
Name: Age, dtype: int64

pandas.core.series.Series

In [8]:
# Een kolom lezen
display(df.Age)

type(df)

a    22
b    35
c    58
Name: Age, dtype: int64

pandas.core.frame.DataFrame

In [9]:
display(df.Name)

age = 'Age'
df[age]

a     Braund, Mr. Owen Harris
b    Allen, Mr. William Henry
c    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

a    22
b    35
c    58
Name: Age, dtype: int64

In [10]:
# Een kolom verwijderen
df_copy = df.copy()

col = df_copy.pop("Age")

display (col)
display (df_copy)
display (df)

a    22
b    35
c    58
Name: Age, dtype: int64

                       Name     Sex
a   Braund, Mr. Owen Harris    male
b  Allen, Mr. William Henry    male
c  Bonnell, Miss. Elizabeth  female

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

In [11]:
df_copy = df.copy()

df_copy_copy = df_copy.drop('Age', axis=1)

display(df_copy)
display(df_copy_copy)

                       Name  Age     Sex
a   Braund, Mr. Owen Harris   22    male
b  Allen, Mr. William Henry   35    male
c  Bonnell, Miss. Elizabeth   58  female

                       Name     Sex
a   Braund, Mr. Owen Harris    male
b  Allen, Mr. William Henry    male
c  Bonnell, Miss. Elizabeth  female

In [12]:
# Een rij lezen

df.loc["a"]

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: a, dtype: object

In [13]:
df.iloc[0]

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: a, dtype: object

In [14]:
df.iloc[0,1]

22

In [15]:
df.loc["a"]["Age"]

22

In [16]:
df.iloc[0]["Age"]

22

In [32]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ]
    }
    
)

# Standaard print
print(df)

# Vergelijk met
df   # jupyther functie
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [18]:
# Functie getRow() maken

def getRow (dataFrame, index):
    return dataFrame.iloc[index]

getRow(df, 2)

Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: c, dtype: object

In [34]:
# Een rij toevoegen
df_copy = df.copy()

# werkt niet
#df_copy.add(["Ruud",44,"Male"], axis=1)


df_copy.loc[3] = ["Ruud", 44, "male"]

display (df_copy)

df_copy.loc[0.5] = ["Hans", 53, "male"]

df_copy_copy = df_copy.sort_index().reset_index(drop=True)

display (df_copy)
display (df_copy_copy)

#

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
3                      Ruud   44    male

                         Name  Age     Sex
0.0   Braund, Mr. Owen Harris   22    male
1.0  Allen, Mr. William Henry   35    male
2.0  Bonnell, Miss. Elizabeth   58  female
3.0                      Ruud   44    male
0.5                      Hans   53    male

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1                      Hans   53    male
2  Allen, Mr. William Henry   35    male
3  Bonnell, Miss. Elizabeth   58  female
4                      Ruud   44    male

In [ ]:
# Functie insertAt(row, index)
# ...

In [ ]:
# Verkennen
# ...

In [40]:
# Filteren
#df.query("Age > 30")

df.query("Age > 30 and Sex == 'male'")

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male

In [51]:
# filteren 2

df_copy[df_copy["Age"]> 50]
# df[df["Age"]> 50]

                         Name  Age     Sex
2.0  Bonnell, Miss. Elizabeth   58  female
0.5                      Hans   53    male

In [57]:
# filteren 3

# df_copy["Name"].str.contains("Bonnell")
df_copy[df_copy["Name"].str.contains("Bonnell")]

                         Name  Age     Sex
2.0  Bonnell, Miss. Elizabeth   58  female

In [ ]:
# Groeperen
# ...

In [ ]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...